In [103]:
import pandas as pd
import numpy as np

In [126]:
link = "https://3083218.youcanlearnit.net/geographytables.html"

area_data2 = pd.read_html(link)  # , match="Area" # choose tables with Area in column
area_data = area_data2.copy()

#area_data = area_data.pop()

In [127]:
area_data2

[   Rank       State  Rainfall in inches
 0     1      Nevada                  10
 1     2     Arizona                  12
 2     3     Wyoming                  56
 3     4  New Mexico                  55
 4     5     Montana                  52
 5     6        Utah                  56,
    Rank        State  Rainfall in inches
 0     1    Louisiana                  59
 1     2  Mississippi                  56
 2     3      Alabama                  56
 3     4      Florida                  55
 4     5    Tennessee                  52
 5     6       Hawaii                  56]

In [7]:
print(type(area_data))

<class 'list'>

In [10]:
type(area_data.pop())

pandas.core.frame.DataFrame

In [117]:
def combine_tables_to_df(area_data2):
  area_data = area_data2.copy()

  df = pd.DataFrame()
  df = pd.concat([df, area_data.pop()])

  for i in range(0, 2):
    df = df.merge(area_data.pop(), on="State", how="outer")
#    df = pd.concat([df, area_data.pop()])
  
  df['Rainfall in inches'] = (df[['Rainfall in inches_x',
                                    'Rainfall in inches_y']]
                                .apply(np.max, axis=1)
#                                .fillna(0)
                              )

  df.drop(columns=['Rank', 'Rank_x', 'Rank_y',
          'Rainfall in inches_x', 'Rainfall in inches_x'], inplace=True)
  return df

In [119]:
df = combine_tables_to_df(area_data2)
#df.fillna(0)
df

          State  Total Area in Sq Mi  Rainfall in inches_y  Rainfall in inches
0        Alaska             665000.0                   NaN                 NaN
1         Texas             268000.0                   NaN                 NaN
2    California             163000.0                   NaN                 NaN
3       Montana             147000.0                  52.0                52.0
4    New Mexico             121000.0                  55.0                55.0
5       Arizona             113000.0                  12.0                12.0
6     Louisiana                  NaN                   NaN                59.0
7   Mississippi                  NaN                   NaN                56.0
8       Alabama                  NaN                   NaN                56.0
9       Florida                  NaN                   NaN                55.0
10    Tennessee                  NaN                   NaN                52.0
11       Hawaii                  NaN                   NaN                56.0
12       Nevada                  NaN                  10.0                10.0
13      Wyoming                  NaN                  56.0                56.0
14         Utah                  NaN                  56.0                56.0